---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ProfileOffsetX
source: html/955b56cc-9230-676f-922e-888fe16b03af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ProfileOffsetX Property

"Horizontal Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId ProfileOffsetX { get; }
```